{"1":{"duration":134,"casts":["Vivian Sung","Ta Lu Wang"],"director":"Frankie Chen","rating":2,"id":1,"synopsis":"We all had to live through and rise above the awkward years in high school, and regardless how long it may have been a distant past you wish to forget, there’s always a beautiful memory somewhere waiting to be awakened. A joyful moment that truly belongs to you. An ordinary high school girl Lin Truly (played by Vivian Sung) pines over the most popular guy in school Ouyang Extraordinary (played by Dino Lee). The school’s troublemaker Hsu Taiyu (played by Ta Lu Wang) falls for the prettiest girl in school Tao Minmin (played by Dewi Chien). Together, Truly and Taiyu, work through misadventures to help each other win their dream dates. Through this youthful rite of passage, their friendship evolves and they learn a thing or two about true love.","title":"Our Times","type":2,"status":2},"2":{"duration":148,"casts":["Daniel Craig","Christoph Waltz"],"director":"Sam Mendes","rating":2,"id":2,"synopsis":"A cryptic message from Bond’s past sends him on a trail to uncover a sinister organisation. While M battles political forces to keep the secret service alive, Bond peels back the layers of deceit to reveal the terrible truth behind SPECTRE.","title":"Spectre","type":0,"status":2},"3":{"duration":103,"casts":["Jack Black","Dylan Minnette"],"director":"Rob Letterman","rating":1,"id":3,"synopsis":"Upset about moving from a big city to a small town, teenager Zach Cooper (Dylan Minnette) finds a silver lining when he meets the beautiful girl, Hannah (Odeya Rush), living right next door. But every silver lining has a cloud, and Zach’s comes when he learns that Hannah has a mysterious dad who is revealed to be R. L. Stine (Jack Black), the author of the bestselling Goosebumps series. It turns out that there is a reason why Stine is so strange… he is a prisoner of his own imagination – the monsters that his books made famous are real, and Stine protects his readers by keeping them locked up in their books. When Zach unintentionally unleashes the monsters from their manuscripts and they begin to terrorize the town, it’s suddenly up to Stine, Zach, and Hannah to get all of them back in the books where they belong.","title":"Goosebumps","type":1,"status":2},"4":{"duration":120,"casts":["songyan","songyan"],"director":"Songyan Ho","rating":0,"id":4,"synopsis":"sss","title":"The Martian","type":0,"status":3},"5":{"duration":180,"casts":["blah","blah"],"director":"blah","rating":0,"id":5,"synopsis":"blah\\","title":"CZ2002","type":2,"status":3},"6":{"duration":120,"casts":["YeongHow ","KhaiHong"],"director":"Songyan","rating":0,"id":6,"synopsis":"learn object oriented programming","title":"CZ2022","type":2,"status":2},"7":{"duration":120,"casts":["Khai Hong","Yeong How","Peishan","Prasanth"],"director":"Songyan Ho","rating":0,"id":7,"synopsis":"Learn Object-Oriented Programming","title":"CZ2002","type":2,"status":2},"8":{"duration":180,"casts":["Khaihong","Peishan"],"director":"Songyan Ho","rating":0,"id":8,"synopsis":"Learn Object Oriented Programming","title":"CZ2002","type":2,"status":3}}